; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_2_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 - counter
	)
  (:init
		(= (value c0) 50)
	(= (value c1) 22)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
		)
	)
)

; plan
1. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 0 of 1
2. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 0 of 1
3. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 0 of 1
4. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 0 of 1
5. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 0 of 1
6. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 0 of 1
7. (increment c1)
   changed: (value c1) from 22 to 28
   goals met: 0 of 1
8. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 0 of 1
9. (increment c1)
   changed: (value c1) from 28 to 35
   goals met: 0 of 1
10. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 0 of 1
11. (increment c1)
   changed: (value c1) from 35 to 43
   goals met: 0 of 1
12. (increment c1)
   changed: (value c1) from 43 to 51
   goals met: 1 of 1
